MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F5016/mcu.h
#define _IPC3_SI2CIP2_POSITION                   0x00000006
#define _IPC3_SI2CIP2_MASK                       0x00000040
#define _IPC3_SI2CIP2_LENGTH                     0x00000001

#define _IPC3_MI2CIP0_POSITION                   0x00000008
#define _IPC3_MI2CIP0_MASK                       0x00000100
#define _IPC3_MI2CIP0_LENGTH                     0x00000001

#define _IPC3_MI2CIP1_POSITION                   0x00000009
#define _IPC3_MI2CIP1_MASK                       0x00000200
#define _IPC3_MI2CIP1_LENGTH                     0x00000001

#define _IPC3_MI2CIP2_POSITION                   0x0000000A
#define _IPC3_MI2CIP2_MASK                       0x00000400
#define _IPC3_MI2CIP2_LENGTH                     0x00000001

#define _IPC3_CNIP0_POSITION                     0x0000000C
#define _IPC3_CNIP0_MASK                         0x00001000
#define _IPC3_CNIP0_LENGTH                       0x00000001

#define _IPC3_CNIP1_POSITION                     0x0000000D
#define _IPC3_CNIP1_MASK                         0x00002000
#define _IPC3_CNIP1_LENGTH                       0x00000001

#define _IPC3_CNIP2_POSITION                     0x0000000E
#define _IPC3_CNIP2_MASK                         0x00004000
#define _IPC3_CNIP2_LENGTH                       0x00000001

#define _IPC4_INT1IP_POSITION                    0x00000000
#define _IPC4_INT1IP_MASK                        0x00000007
#define _IPC4_INT1IP_LENGTH                      0x00000003

#define _IPC4_OC3IP_POSITION                     0x0000000C
#define _IPC4_OC3IP_MASK                         0x00007000
#define _IPC4_OC3IP_LENGTH                       0x00000003

#define _IPC4_INT1IP0_POSITION                   0x00000000
#define _IPC4_INT1IP0_MASK                       0x00000001
#define _IPC4_INT1IP0_LENGTH                     0x00000001

#define _IPC4_INT1IP1_POSITION                   0x00000001
#define _IPC4_INT1IP1_MASK                       0x00000002
#define _IPC4_INT1IP1_LENGTH                     0x00000001

#define _IPC4_INT1IP2_POSITION                   0x00000002
#define _IPC4_INT1IP2_MASK                       0x00000004
#define _IPC4_INT1IP2_LENGTH                     0x00000001

#define _IPC4_OC3IP0_POSITION                    0x0000000C
#define _IPC4_OC3IP0_MASK                        0x00001000
#define _IPC4_OC3IP0_LENGTH                      0x00000001

#define _IPC4_OC3IP1_POSITION                    0x0000000D
#define _IPC4_OC3IP1_MASK                        0x00002000
#define _IPC4_OC3IP1_LENGTH                      0x00000001

#define _IPC4_OC3IP2_POSITION                    0x0000000E
#define _IPC4_OC3IP2_MASK                        0x00004000
#define _IPC4_OC3IP2_LENGTH                      0x00000001

#define _IPC5_OC4IP_POSITION                     0x00000000
#define _IPC5_OC4IP_MASK                         0x00000007
#define _IPC5_OC4IP_LENGTH                       0x00000003

#define _IPC5_T4IP_POSITION                      0x00000004
#define _IPC5_T4IP_MASK                          0x00000070
#define _IPC5_T4IP_LENGTH                        0x00000003

#define _IPC5_T5IP_POSITION                      0x00000008
#define _IPC5_T5IP_MASK                          0x00000700
#define _IPC5_T5IP_LENGTH                        0x00000003

#define _IPC5_INT2IP_POSITION                    0x0000000C
#define _IPC5_INT2IP_MASK                        0x00007000
#define _IPC5_INT2IP_LENGTH                      0x00000003

#define _IPC5_OC4IP0_POSITION                    0x00000000
#define _IPC5_OC4IP0_MASK                        0x00000001
#define _IPC5_OC4IP0_LENGTH                      0x00000001

#define _IPC5_OC4IP1_POSITION                    0x00000001
#define _IPC5_OC4IP1_MASK                        0x00000002
#define _IPC5_OC4IP1_LENGTH                      0x00000001

#define _IPC5_OC4IP2_POSITION                    0x00000002
#define _IPC5_OC4IP2_MASK                        0x00000004
#define _IPC5_OC4IP2_LENGTH                      0x00000001

#define _IPC5_T4IP0_POSITION                     0x00000004
#define _IPC5_T4IP0_MASK                         0x00000010
#define _IPC5_T4IP0_LENGTH                       0x00000001

#define _IPC5_T4IP1_POSITION                     0x00000005
#define _IPC5_T4IP1_MASK                         0x00000020
#define _IPC5_T4IP1_LENGTH                       0x00000001

#define _IPC5_T4IP2_POSITION                     0x00000006
#define _IPC5_T4IP2_MASK                         0x00000040
#define _IPC5_T4IP2_LENGTH                       0x00000001

#define _IPC5_T5IP0_POSITION                     0x00000008
#define _IPC5_T5IP0_MASK                         0x00000100
#define _IPC5_T5IP0_LENGTH                       0x00000001

#define _IPC5_T5IP1_POSITION                     0x00000009
#define _IPC5_T5IP1_MASK                         0x00000200
#define _IPC5_T5IP1_LENGTH                       0x00000001

#define _IPC5_T5IP2_POSITION                     0x0000000A
#define _IPC5_T5IP2_MASK                         0x00000400
#define _IPC5_T5IP2_LENGTH                       0x00000001

#define _IPC5_INT2IP0_POSITION                   0x0000000C
#define _IPC5_INT2IP0_MASK                       0x00001000
#define _IPC5_INT2IP0_LENGTH                     0x00000001

#define _IPC5_INT2IP1_POSITION                   0x0000000D
#define _IPC5_INT2IP1_MASK                       0x00002000
#define _IPC5_INT2IP1_LENGTH                     0x00000001

#define _IPC5_INT2IP2_POSITION                   0x0000000E
#define _IPC5_INT2IP2_MASK                       0x00004000
#define _IPC5_INT2IP2_LENGTH                     0x00000001

#define _IPC6_SPI2IP_POSITION                    0x00000008
#define _IPC6_SPI2IP_MASK                        0x00000700
#define _IPC6_SPI2IP_LENGTH                      0x00000003

#define _IPC6_C1IP_POSITION                      0x0000000C
#define _IPC6_C1IP_MASK                          0x00007000
#define _IPC6_C1IP_LENGTH                        0x00000003

#define _IPC6_SPI2IP0_POSITION                   0x00000008
#define _IPC6_SPI2IP0_MASK                       0x00000100
#define _IPC6_SPI2IP0_LENGTH                     0x00000001

